constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    outlet-1
    {
        type            patch;
       // physicalType    patch;
        nFaces          584;
        startFace       75722;
    }
    wall
    {
        type            wall;
       // physicalType    patch;
        nFaces          3448;
        startFace       76306;
    }
    outlet-2
    {
        type            patch;
      //  physicalType    patch;
        nFaces          124;
        startFace       79754;
    }
    inlet
    {
        type            patch;
       // physicalType    patch;
        nFaces          172;
        startFace       79878;
    }
)

// ************************************************************************* //
