0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (45 0 0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet-1
    {
        type            slip;
    }
	
	outlet-2
    {
        type            zeroGradient;
    }

    wall
    {
        type            slip;
    }

    //frontAndBack
    //{
    //    type            empty;
    //}
}

// ************************************************************************* //
