0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField  uniform 100000;

boundaryField
{
    inlet
    {
        type            totalPressure;
        rho             rho;
        psi             thermo:psi;
        gamma           1.4;
        p0              uniform 800000;
        value           uniform 800000;
    }

    outlet-1
    {
       // type            waveTransmissive;
       // field           p;
       // psi             thermo:psi;
       // gamma           1.3;
       // fieldInf        70636.93133;
       // lInf            1;
       // value           uniform 70636.93133;
		type			  zeroGradient;
	}
	
	outlet-2
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        100000;
        lInf            1.0;
        value           uniform 100000;

    }

    wall
    {
        type            zeroGradient;
    }

   // frontAndBack
   // {
   //     type            empty;
   // }
}

// ************************************************************************* //
